In [2]:
import pandas as pd
import numpy as np
data3 = pd.read_csv("..//raw//ex_rate_usd_rub.csv",header=None) #relative path represented as ..
data3.columns=['Date3','exchangerub']
print(data3.columns)

Index(['Date3', 'exchangerub'], dtype='object')

In [3]:
#removed the uncessary 0th index row
data3=data3.drop(index=[0])
data3

          Date3          exchangerub
1    1992-06-01   0.1380000000000000
2    1992-07-01   0.1680000000000000
3    1992-08-01   0.2170000000000000
4    1992-09-01   0.3440000000000000
5    1992-10-01   0.4240000000000000
..          ...                  ...
381  2024-02-01  91.6102999999999952
382  2024-03-01  91.6941000000000059
383  2024-04-01  92.8855999999999966
384  2024-05-01  90.8704000000000036
385  2024-06-01  88.0459000000000032

[385 rows x 2 columns]

In [4]:
data3['Date3'] = pd.to_datetime(data3['Date3'], format='%Y-%m-%d',errors='coerce')
data3['exchangerub']=pd.to_numeric(data3['exchangerub'],errors='coerce') 
data3=data3.dropna(subset=['Date3'])  #drop rows with invalid data
data3

         Date3  exchangerub
1   1992-06-01       0.1380
2   1992-07-01       0.1680
3   1992-08-01       0.2170
4   1992-09-01       0.3440
5   1992-10-01       0.4240
..         ...          ...
381 2024-02-01      91.6103
382 2024-03-01      91.6941
383 2024-04-01      92.8856
384 2024-05-01      90.8704
385 2024-06-01      88.0459

[385 rows x 2 columns]

In [5]:
data3.set_index('Date3',inplace=True) 
quarterly3=data3.resample('QE').mean() 
quarterly3.reset_index(inplace=True)  
print(quarterly3)

         Date3  exchangerub
0   1992-06-30     0.138000
1   1992-09-30     0.243000
2   1992-12-31     0.433667
3   1993-03-31     0.661000
4   1993-06-30     1.001000
..         ...          ...
124 2023-06-30    80.987933
125 2023-09-30    94.109600
126 2023-12-31    92.779300
127 2024-03-31    90.762300
128 2024-06-30    90.600633

[129 rows x 2 columns]

In [6]:
quarterly3.to_csv("ex_rate_rub.csv", index=False)

In [7]:
quarterly3

         Date3  exchangerub
0   1992-06-30     0.138000
1   1992-09-30     0.243000
2   1992-12-31     0.433667
3   1993-03-31     0.661000
4   1993-06-30     1.001000
..         ...          ...
124 2023-06-30    80.987933
125 2023-09-30    94.109600
126 2023-12-31    92.779300
127 2024-03-31    90.762300
128 2024-06-30    90.600633

[129 rows x 2 columns]